artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: 1 step (20x5)
  defaults:
    headers:
      authorization: "Bearer {{ token }}"
  variables:
    token:
      - "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJsb2dpbiI6ImFkbWluIiwicGFzc3dvcmQiOiJhZG1pbiIsImlhdCI6MTYyNTY2MDg1NSwiZXhwIjoxNjI1NzQ3MjU1fQ.5H8-imaBqsPiWJ2K7JzsI7DRCyPnmv4PattAEZXaIy0"
scenarios:
  - name: "users"
    flow:
      - get:
          url: "/users"
      - post:
          url: "/users"
          json:
            name: "123"
            login: "testing{{ $randomString(8) }}"
            password: "password"
          capture:
            - json: $.id
              as: userId
      - put:
          url: "/users/{{ userId }}"
          json:
            name: "1234"
            login: "testing{{ $randomString(8) }}"
            password: "admin3"
      - get:
          url: "/users/{{ userId }}"
      - delete:
          url: "/users/{{ userId }}"